app/views/etclassics/index.html.erb


<%= area_chart [{ name: 'eth', data: @eths.map {|el| [el.created_at, el.profit]}}, { name: 'etc', data: @etclassics.map {|el| [el.created_at, el.profit]}}], refresh: 60, label: "eth_etc", legend: true %>
---
INSERT INTO "etclassics" ("profit", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profit", 12.226840247035355], ["created_at", "2019-08-11 10:54:28.996612"], ["updated_at", "2019-08-11 10:54:28.996612"]]
INSERT INTO "eths" ("profit", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profit", 15.709502986900096], ["created_at", "2019-08-11 10:54:29.868936"], ["updated_at", "2019-08-11 10:54:29.868936"]]
SELECT "eths".* FROM "eths"