app/controllers/etclassics_controller.rb

INSERT INTO "etclassics" ("profit", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profit", 12.226840247035355], ["created_at", "2019-08-11 10:54:28.996612"], ["updated_at", "2019-08-11 10:54:28.996612"]]
SELECT "etclassics".* FROM "etclassics"
---
	def index
      require 'httparty'
      require 'cryptocompare'
        @difficulty2 = HTTParty.get('https://etc.2miners.com/api/stats')['nodes'].first['difficulty'].to_i
        @exchange2 = Cryptocompare::Price.find('ETC', 'USDT')['ETC']['USDT'].to_f

        b2 = 379/100
        l2 = 13.95
        d2 = @difficulty2
        e2 = @exchange2
        hrt2 = d2/l2
        h2 = 10**9
        t2 = 24*60*60
        @f = (((h2/hrt2)*b2*t2)/l2)*e2


        Etclassic.create(profit: @f)

        @etclassics = Etclassic.all
        @etclassics.each do |etclassic|

INSERT INTO "eths" ("profit", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profit", 15.709502986900096], ["created_at", "2019-08-11 10:54:29.868936"], ["updated_at", "2019-08-11 10:54:29.868936"]]
SELECT "eths".* FROM "eths"
---
        t = 24*60*60
        @p = (((h/hrt)*b*t)/l)*e

        Eth.create(profit: @p)

        @eths = Eth.all
        @eths.each do |eth|