app/views/eths/index.html.erb


<%= area_chart [{ name: 'eth', data: @eths.map {|el| [el.created_at, el.profit]}}, { name: 'etclassic', data: @etclassics.map {|el| [el.created_at, el.profit]}}], refresh: 60, label: "eth", legend: true %>
---
INSERT INTO "eths" ("profit", "created_at", "updated_at") VALUES (?, ?, ?)  [["profit", 16.137694277439042], ["created_at", "2019-08-09 12:35:09.834240"], ["updated_at", "2019-08-09 12:35:09.834240"]]
SELECT "eths".* FROM "eths"